FIOLOG/nvme0n1_220608_142131_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 512B-64.0KiB, (W) 512B-64.0KiB, (T) 512B-64.0KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=17769: Wed Jun  8 14:21:51 2022
  write: IOPS=13.0k, BW=96.9MiB/s (102MB/s)(1937MiB/20001msec); 0 zone resets
    slat (usec): min=2, max=177, avg= 8.97, stdev= 7.67
    clat (usec): min=37, max=43438, avg=1222.76, stdev=4147.26
     lat (usec): min=80, max=43446, avg=1231.88, stdev=4148.23
    clat percentiles (usec):
     |  1.00th=[  219],  5.00th=[  253], 10.00th=[  273], 20.00th=[  293],
     | 30.00th=[  310], 40.00th=[  326], 50.00th=[  338], 60.00th=[  355],
     | 70.00th=[  375], 80.00th=[  420], 90.00th=[  881], 95.00th=[ 1434],
     | 99.00th=[22676], 99.50th=[23462], 99.90th=[24511], 99.95th=[25035],
     | 99.99th=[34341]
   bw (  KiB/s): min=42090, max=359170, per=50.65%, avg=100594.79, stdev=111631.74, samples=39
   iops        : min= 5400, max=46420, avg=13149.08, stdev=14611.13, samples=39
  lat (usec)   : 50=0.01%, 100=0.01%, 250=4.40%, 500=79.75%, 750=3.89%
  lat (usec)   : 1000=3.40%
  lat (msec)   : 2=4.64%, 4=0.16%, 10=0.02%, 20=0.17%, 50=3.55%
  cpu          : usr=7.07%, sys=12.52%, ctx=102957, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,259421,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=17770: Wed Jun  8 14:21:51 2022
  write: IOPS=13.0k, BW=97.1MiB/s (102MB/s)(1942MiB/20001msec); 0 zone resets
    slat (usec): min=2, max=137, avg= 8.91, stdev= 7.68
    clat (usec): min=22, max=43400, avg=1221.13, stdev=4143.84
     lat (usec): min=32, max=43408, avg=1230.20, stdev=4144.82
    clat percentiles (usec):
     |  1.00th=[  219],  5.00th=[  253], 10.00th=[  273], 20.00th=[  293],
     | 30.00th=[  310], 40.00th=[  326], 50.00th=[  338], 60.00th=[  355],
     | 70.00th=[  375], 80.00th=[  420], 90.00th=[  881], 95.00th=[ 1434],
     | 99.00th=[22676], 99.50th=[23462], 99.90th=[24511], 99.95th=[25035],
     | 99.99th=[34341]
   bw (  KiB/s): min=39501, max=356791, per=50.76%, avg=100816.05, stdev=112237.77, samples=39
   iops        : min= 5440, max=46442, avg=13167.49, stdev=14601.99, samples=39
  lat (usec)   : 50=0.01%, 250=4.49%, 500=79.71%, 750=3.87%, 1000=3.40%
  lat (msec)   : 2=4.62%, 4=0.16%, 10=0.03%, 20=0.17%, 50=3.55%
  cpu          : usr=7.45%, sys=12.04%, ctx=104202, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,259774,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=194MiB/s (203MB/s), 96.9MiB/s-97.1MiB/s (102MB/s-102MB/s), io=3879MiB (4068MB), run=20001-20001msec

Disk stats (read/write):
  nvme0n1: ios=51/518120, merge=0/0, ticks=13/591324, in_queue=591338, util=99.72%