FIOLOG/nvme0n1_220608_142314_fio.log
/dev/nvme0n1: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=22710: Wed Jun  8 14:24:14 2022
  write: IOPS=6820, BW=853MiB/s (894MB/s)(50.0GiB/60008msec); 0 zone resets
    slat (usec): min=13, max=3524, avg=44.38, stdev=15.78
    clat (usec): min=558, max=59647, avg=4644.88, stdev=4695.65
     lat (usec): min=583, max=59682, avg=4689.53, stdev=4697.96
    clat percentiles (usec):
     |  1.00th=[ 2900],  5.00th=[ 3064], 10.00th=[ 3163], 20.00th=[ 3326],
     | 30.00th=[ 3425], 40.00th=[ 3523], 50.00th=[ 3621], 60.00th=[ 3720],
     | 70.00th=[ 3818], 80.00th=[ 3916], 90.00th=[ 4146], 95.00th=[ 5866],
     | 99.00th=[27132], 99.50th=[27919], 99.90th=[30540], 99.95th=[39060],
     | 99.99th=[47973]
   bw (  KiB/s): min=146395, max=1184768, per=100.00%, avg=877032.17, stdev=398382.84, samples=119
   iops        : min= 1143, max= 9256, avg=6851.81, stdev=3112.38, samples=119
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.03%, 4=84.51%, 10=10.66%, 20=0.71%, 50=4.08%
  lat (msec)   : 100=0.01%
  cpu          : usr=10.35%, sys=28.09%, ctx=174346, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,409282,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=853MiB/s (894MB/s), 853MiB/s-853MiB/s (894MB/s-894MB/s), io=50.0GiB (53.6GB), run=60008-60008msec

Disk stats (read/write):
  nvme0n1: ios=48/408871, merge=0/0, ticks=3/1881943, in_queue=1881947, util=99.96%