FIOLOG/nvme0n1_220608_142824_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48634: Wed Jun  8 14:28:34 2022
  read: IOPS=41.0k, BW=160MiB/s (168MB/s)(1603MiB/10002msec)
    slat (nsec): min=1791, max=74661, avg=3596.14, stdev=2464.45
    clat (usec): min=1174, max=23101, avg=1555.43, stdev=231.79
     lat (usec): min=1178, max=23115, avg=1559.11, stdev=231.95
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1549],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1565], 90.00th=[ 1565], 95.00th=[ 1582],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1663], 99.95th=[ 1942],
     | 99.99th=[16581]
   bw (  KiB/s): min=157800, max=164952, per=25.01%, avg=164189.47, stdev=1554.81, samples=19
   iops        : min=39450, max=41238, avg=41047.37, stdev=388.70, samples=19
  lat (msec)   : 2=99.95%, 4=0.03%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=8.46%, sys=18.05%, ctx=168069, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=410377,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48635: Wed Jun  8 14:28:34 2022
  read: IOPS=41.0k, BW=160MiB/s (168MB/s)(1603MiB/10002msec)
    slat (nsec): min=1808, max=545462, avg=3610.25, stdev=2580.15
    clat (usec): min=1200, max=23075, avg=1555.13, stdev=219.00
     lat (usec): min=1210, max=23088, avg=1558.83, stdev=219.16
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1549],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1565], 90.00th=[ 1565], 95.00th=[ 1582],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1663], 99.95th=[ 1827],
     | 99.99th=[14746]
   bw (  KiB/s): min=157864, max=165016, per=25.02%, avg=164221.89, stdev=1548.48, samples=19
   iops        : min=39466, max=41254, avg=41055.47, stdev=387.12, samples=19
  lat (msec)   : 2=99.95%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=9.70%, sys=17.18%, ctx=173131, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=410459,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48636: Wed Jun  8 14:28:34 2022
  read: IOPS=41.0k, BW=160MiB/s (168MB/s)(1603MiB/10002msec)
    slat (nsec): min=1775, max=65547, avg=3630.70, stdev=2462.80
    clat (usec): min=1174, max=23114, avg=1555.62, stdev=234.29
     lat (usec): min=1178, max=23127, avg=1559.34, stdev=234.44
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1549],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1565], 90.00th=[ 1565], 95.00th=[ 1582],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1647], 99.95th=[ 1680],
     | 99.99th=[17433]
   bw (  KiB/s): min=158352, max=164736, per=25.01%, avg=164153.26, stdev=1410.47, samples=19
   iops        : min=39588, max=41184, avg=41038.32, stdev=352.62, samples=19
  lat (msec)   : 2=99.97%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=8.83%, sys=17.93%, ctx=158177, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=410317,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48637: Wed Jun  8 14:28:34 2022
  read: IOPS=41.0k, BW=160MiB/s (168MB/s)(1602MiB/10002msec)
    slat (nsec): min=1760, max=308339, avg=3608.09, stdev=2571.48
    clat (usec): min=1179, max=23125, avg=1555.99, stdev=232.70
     lat (usec): min=1194, max=23138, avg=1559.68, stdev=232.86
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1516], 10.00th=[ 1532], 20.00th=[ 1549],
     | 30.00th=[ 1549], 40.00th=[ 1549], 50.00th=[ 1549], 60.00th=[ 1549],
     | 70.00th=[ 1549], 80.00th=[ 1565], 90.00th=[ 1565], 95.00th=[ 1582],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1663], 99.95th=[ 1942],
     | 99.99th=[17433]
   bw (  KiB/s): min=157112, max=164768, per=25.00%, avg=164115.79, stdev=1708.44, samples=19
   iops        : min=39278, max=41192, avg=41028.95, stdev=427.11, samples=19
  lat (msec)   : 2=99.95%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=9.31%, sys=17.21%, ctx=162772, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=410224,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=641MiB/s (672MB/s), 160MiB/s-160MiB/s (168MB/s-168MB/s), io=6412MiB (6723MB), run=10002-10002msec

Disk stats (read/write):
  nvme0n1: ios=1624097/0, merge=0/0, ticks=2510792/0, in_queue=2510792, util=99.05%